rtest-framework/testing/sample/sample_xml/sample.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:data="http://data.external.endurance.services.active.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <data:findOrganizationUsersByAgencyId>
         <!--Optional:-->
         <context>
            <!--Optional:-->
            <callerIp>?</callerIp>
            <!--Optional:-->
            <applicationId>?</applicationId>
            <!--Optional:-->
            <actionId>?</actionId>
            <!--Optional:-->
            <actorId>?</actorId>
            <!--Optional:-->
            <onBehalfOfId>?</onBehalfOfId>
            <!--Optional:-->
            <onBelhalfOfId>?</onBelhalfOfId>
            <!--Optional:-->
            <enterpriseActorId>?</enterpriseActorId>
            <!--Optional:-->
            <agencyId>?</agencyId>
            <!--Optional:-->
            <agencyIdLong>?</agencyIdLong>
            <!--Optional:-->
            <externalClientId>?</externalClientId>
         </context>
         <!--Optional:-->
         <agencyId>?</agencyId>
      </data:findOrganizationUsersByAgencyId>
   </soapenv:Body>
</soapenv:Envelope>